spec/cassettes/A_voided_payment_in_Solidus/refunds_the_Shopify_transaction.yml

---
http_interactions:
- request:
    method: post
    uri: https://glossier-pop-staging.myshopify.com/admin/orders.json
    body:
      encoding: UTF-8
      string: '{"order":{"email":"cab@godynamo.com","test":true,"fulfillment_status":"fulfilled","line_items":[{"variant_id":"447654529","quantity":1,"name":"test","price":100,"title":"title"}],"customer":{"first_name":"Paul","last_name":"Norman","email":"paul.norman@example.com"},"billing_address":{"first_name":"John","last_name":"Smith","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","province":"Ontario","country":"Canada","zip":"K2P
        1L4"},"shipping_address":{"first_name":"John","last_name":"Smith","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","province":"Ontario","country":"Canada","zip":"K2P
        1L4"},"transactions":[{"kind":"capture","status":"success","amount":100}],"financial_status":"paid"}}'
    headers:
      Authorization:
      - Basic MWI3ZjYzYmYyNDg4MzFjN2FlMmJlYWNmOWJjMzBiYmI6YjFjOTE1NTE1ZDA4ZTIwMzc5MzBhODQ0Zjc0MzY2MTA=
      Content-Type:
      - application/json
      User-Agent:
      - ShopifyAPI/4.3.2 ActiveResource/4.1.0 Ruby/2.3.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Server:
      - nginx
      Date:
      - Thu, 29 Sep 2016 14:56:24 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Frame-Options:
      - DENY
      X-Shopid:
      - '6779563'
      X-Shardid:
      - '2'
      X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      Http-X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      X-Stats-Userid:
      - '0'
      X-Stats-Apiclientid:
      - '1413328'
      X-Stats-Apipermissionid:
      - '23658502'
      Location:
      - https://glossier-pop-staging.myshopify.com/admin/orders/3836113411
      X-Xss-Protection:
      - 1; mode=block; report=/xss-report/6f5d3bb6-36b3-47dd-a8e8-d20d129e8b29?source%5Baction%5D=create&source%5Bcontroller%5D=admin%2Forders&source%5Bsection%5D=admin
      X-Request-Id:
      - 6f5d3bb6-36b3-47dd-a8e8-d20d129e8b29
      P3p:
      - CP="NOI DSP COR NID ADMa OPTa OUR NOR"
      X-Dc:
      - ash
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Content-Type-Options:
      - nosniff
      - nosniff
    body:
      encoding: UTF-8
      string: '{"order":{"id":3836113411,"email":"cab@godynamo.com","closed_at":null,"created_at":"2016-09-29T10:56:24-04:00","updated_at":"2016-09-29T10:56:24-04:00","number":408,"note":null,"token":"b523716f8577460710c16a61edc197ff","gateway":"","test":false,"total_price":"100.00","subtotal_price":"100.00","total_weight":0,"total_tax":"0.00","taxes_included":false,"currency":"CAD","financial_status":"paid","confirmed":true,"total_discounts":"0.00","total_line_items_price":"100.00","cart_token":null,"buyer_accepts_marketing":false,"name":"#1408","referring_site":null,"landing_site":null,"cancelled_at":null,"cancel_reason":null,"total_price_usd":"76.55","checkout_token":null,"reference":null,"user_id":null,"location_id":null,"source_identifier":null,"source_url":null,"processed_at":"2016-09-29T10:56:24-04:00","device_id":null,"browser_ip":null,"landing_site_ref":null,"order_number":1408,"discount_codes":[],"note_attributes":[],"payment_gateway_names":[""],"processing_method":"","checkout_id":null,"source_name":"1413328","fulfillment_status":"fulfilled","tax_lines":[],"tags":"","contact_email":"cab@godynamo.com","order_status_url":null,"line_items":[{"id":7084987971,"variant_id":null,"title":"title","quantity":1,"price":"100.00","grams":0,"sku":null,"variant_title":null,"vendor":null,"fulfillment_service":"manual","product_id":null,"requires_shipping":true,"taxable":true,"gift_card":false,"name":"title","variant_inventory_management":null,"properties":[],"product_exists":false,"fulfillable_quantity":0,"total_discount":"0.00","fulfillment_status":"fulfilled","tax_lines":[]}],"shipping_lines":[],"billing_address":{"first_name":"John","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","zip":"K2P 1L4","province":"Ontario","country":"Canada","last_name":"Smith","address2":null,"company":null,"latitude":null,"longitude":null,"name":"John
        Smith","country_code":"CA","province_code":"ON"},"shipping_address":{"first_name":"John","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","zip":"K2P 1L4","province":"Ontario","country":"Canada","last_name":"Smith","address2":null,"company":null,"latitude":null,"longitude":null,"name":"John
        Smith","country_code":"CA","province_code":"ON"},"fulfillments":[{"id":3140974915,"order_id":3836113411,"status":"success","created_at":"2016-09-29T10:56:24-04:00","service":"manual","updated_at":"2016-09-29T10:56:24-04:00","tracking_company":null,"shipment_status":null,"tracking_number":null,"tracking_numbers":[],"tracking_url":null,"tracking_urls":[],"receipt":{},"line_items":[{"id":7084987971,"variant_id":null,"title":"title","quantity":1,"price":"100.00","grams":0,"sku":null,"variant_title":null,"vendor":null,"fulfillment_service":"manual","product_id":null,"requires_shipping":true,"taxable":true,"gift_card":false,"name":"title","variant_inventory_management":null,"properties":[],"product_exists":false,"fulfillable_quantity":0,"total_discount":"0.00","fulfillment_status":"fulfilled","tax_lines":[]}]}],"refunds":[],"customer":{"id":3934271555,"email":"paul.norman@example.com","accepts_marketing":false,"created_at":"2016-08-10T15:41:49-04:00","updated_at":"2016-09-29T10:56:24-04:00","first_name":"Paul","last_name":"Norman","orders_count":4,"state":"disabled","total_spent":"400.00","last_order_id":3836113411,"note":null,"verified_email":true,"multipass_identifier":null,"tax_exempt":false,"tags":"","last_order_name":"#1408","default_address":{"id":4150214851,"first_name":"John","last_name":"Smith","company":null,"address1":"123
        Fake Street","address2":null,"city":"Fakecity","province":"Ontario","country":"Canada","zip":"K2P
        1L4","phone":"555-555-5555","name":"John Smith","province_code":"ON","country_code":"CA","country_name":"Canada","default":true}}}}'
    http_version: 
  recorded_at: Thu, 29 Sep 2016 14:56:24 GMT
- request:
    method: get
    uri: https://glossier-pop-staging.myshopify.com/admin/orders/3836113411.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Basic MWI3ZjYzYmYyNDg4MzFjN2FlMmJlYWNmOWJjMzBiYmI6YjFjOTE1NTE1ZDA4ZTIwMzc5MzBhODQ0Zjc0MzY2MTA=
      Accept:
      - application/json
      User-Agent:
      - ShopifyAPI/4.3.2 ActiveResource/4.1.0 Ruby/2.3.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 29 Sep 2016 14:56:24 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      X-Frame-Options:
      - DENY
      X-Shopid:
      - '6779563'
      X-Shardid:
      - '2'
      X-Shopify-Shop-Api-Call-Limit:
      - 3/40
      Http-X-Shopify-Shop-Api-Call-Limit:
      - 3/40
      X-Stats-Userid:
      - '0'
      X-Stats-Apiclientid:
      - '1413328'
      X-Stats-Apipermissionid:
      - '23658502'
      X-Xss-Protection:
      - 1; mode=block; report=/xss-report/ac2ba364-9351-4841-a4c8-0bc01b7827e3?source%5Baction%5D=show&source%5Bcontroller%5D=admin%2Forders&source%5Bsection%5D=admin
      X-Request-Id:
      - ac2ba364-9351-4841-a4c8-0bc01b7827e3
      P3p:
      - CP="NOI DSP COR NID ADMa OPTa OUR NOR"
      X-Dc:
      - ash
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Content-Type-Options:
      - nosniff
      - nosniff
    body:
      encoding: ASCII-8BIT
      string: '{"order":{"id":3836113411,"email":"cab@godynamo.com","closed_at":null,"created_at":"2016-09-29T10:56:24-04:00","updated_at":"2016-09-29T10:56:24-04:00","number":408,"note":null,"token":"b523716f8577460710c16a61edc197ff","gateway":"","test":false,"total_price":"100.00","subtotal_price":"100.00","total_weight":0,"total_tax":"0.00","taxes_included":false,"currency":"CAD","financial_status":"paid","confirmed":true,"total_discounts":"0.00","total_line_items_price":"100.00","cart_token":null,"buyer_accepts_marketing":false,"name":"#1408","referring_site":null,"landing_site":null,"cancelled_at":null,"cancel_reason":null,"total_price_usd":"76.55","checkout_token":null,"reference":null,"user_id":null,"location_id":null,"source_identifier":null,"source_url":null,"processed_at":"2016-09-29T10:56:24-04:00","device_id":null,"browser_ip":null,"landing_site_ref":null,"order_number":1408,"discount_codes":[],"note_attributes":[],"payment_gateway_names":[""],"processing_method":"","checkout_id":null,"source_name":"1413328","fulfillment_status":"fulfilled","tax_lines":[],"tags":"","contact_email":"cab@godynamo.com","order_status_url":null,"line_items":[{"id":7084987971,"variant_id":null,"title":"title","quantity":1,"price":"100.00","grams":0,"sku":null,"variant_title":null,"vendor":null,"fulfillment_service":"manual","product_id":null,"requires_shipping":true,"taxable":true,"gift_card":false,"name":"title","variant_inventory_management":null,"properties":[],"product_exists":false,"fulfillable_quantity":0,"total_discount":"0.00","fulfillment_status":"fulfilled","tax_lines":[]}],"shipping_lines":[],"billing_address":{"first_name":"John","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","zip":"K2P 1L4","province":"Ontario","country":"Canada","last_name":"Smith","address2":null,"company":null,"latitude":45.4203521,"longitude":-75.69314750000001,"name":"John
        Smith","country_code":"CA","province_code":"ON"},"shipping_address":{"first_name":"John","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","zip":"K2P 1L4","province":"Ontario","country":"Canada","last_name":"Smith","address2":null,"company":null,"latitude":45.4203521,"longitude":-75.69314750000001,"name":"John
        Smith","country_code":"CA","province_code":"ON"},"fulfillments":[{"id":3140974915,"order_id":3836113411,"status":"success","created_at":"2016-09-29T10:56:24-04:00","service":"manual","updated_at":"2016-09-29T10:56:24-04:00","tracking_company":null,"shipment_status":null,"tracking_number":null,"tracking_numbers":[],"tracking_url":null,"tracking_urls":[],"receipt":{},"line_items":[{"id":7084987971,"variant_id":null,"title":"title","quantity":1,"price":"100.00","grams":0,"sku":null,"variant_title":null,"vendor":null,"fulfillment_service":"manual","product_id":null,"requires_shipping":true,"taxable":true,"gift_card":false,"name":"title","variant_inventory_management":null,"properties":[],"product_exists":false,"fulfillable_quantity":0,"total_discount":"0.00","fulfillment_status":"fulfilled","tax_lines":[]}]}],"refunds":[],"customer":{"id":3934271555,"email":"paul.norman@example.com","accepts_marketing":false,"created_at":"2016-08-10T15:41:49-04:00","updated_at":"2016-09-29T10:56:24-04:00","first_name":"Paul","last_name":"Norman","orders_count":4,"state":"disabled","total_spent":"400.00","last_order_id":3836113411,"note":null,"verified_email":true,"multipass_identifier":null,"tax_exempt":false,"tags":"","last_order_name":"#1408","default_address":{"id":4150214851,"first_name":"John","last_name":"Smith","company":null,"address1":"123
        Fake Street","address2":null,"city":"Fakecity","province":"Ontario","country":"Canada","zip":"K2P
        1L4","phone":"555-555-5555","name":"John Smith","province_code":"ON","country_code":"CA","country_name":"Canada","default":true}}}}'
    http_version: 
  recorded_at: Thu, 29 Sep 2016 14:56:24 GMT
- request:
    method: get
    uri: https://glossier-pop-staging.myshopify.com/admin/orders/3836113411/transactions.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Basic MWI3ZjYzYmYyNDg4MzFjN2FlMmJlYWNmOWJjMzBiYmI6YjFjOTE1NTE1ZDA4ZTIwMzc5MzBhODQ0Zjc0MzY2MTA=
      Accept:
      - application/json
      User-Agent:
      - ShopifyAPI/4.3.2 ActiveResource/4.1.0 Ruby/2.3.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 29 Sep 2016 14:56:25 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      X-Frame-Options:
      - DENY
      X-Shopid:
      - '6779563'
      X-Shardid:
      - '2'
      X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      Http-X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      X-Stats-Userid:
      - '0'
      X-Stats-Apiclientid:
      - '1413328'
      X-Stats-Apipermissionid:
      - '23658502'
      X-Xss-Protection:
      - 1; mode=block; report=/xss-report/68a0c77f-94a0-4736-9246-62de2b80dc7b?source%5Baction%5D=index&source%5Bcontroller%5D=admin%2Ftransactions&source%5Bsection%5D=admin
      X-Request-Id:
      - 68a0c77f-94a0-4736-9246-62de2b80dc7b
      P3p:
      - CP="NOI DSP COR NID ADMa OPTa OUR NOR"
      X-Dc:
      - ash
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Content-Type-Options:
      - nosniff
      - nosniff
    body:
      encoding: ASCII-8BIT
      string: '{"transactions":[{"id":4191791427,"order_id":3836113411,"amount":"100.00","kind":"capture","gateway":"","status":"success","message":null,"created_at":"2016-09-29T10:56:24-04:00","test":false,"authorization":null,"currency":"CAD","location_id":null,"user_id":null,"parent_id":null,"device_id":null,"receipt":{},"error_code":null,"source_name":"1413328"}]}'
    http_version: 
  recorded_at: Thu, 29 Sep 2016 14:56:25 GMT
- request:
    method: get
    uri: https://glossier-pop-staging.myshopify.com/admin/orders/3836113411/transactions/4191791427.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Basic MWI3ZjYzYmYyNDg4MzFjN2FlMmJlYWNmOWJjMzBiYmI6YjFjOTE1NTE1ZDA4ZTIwMzc5MzBhODQ0Zjc0MzY2MTA=
      Accept:
      - application/json
      User-Agent:
      - ShopifyAPI/4.3.2 ActiveResource/4.1.0 Ruby/2.3.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 29 Sep 2016 14:56:25 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      X-Frame-Options:
      - DENY
      X-Shopid:
      - '6779563'
      X-Shardid:
      - '2'
      X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      Http-X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      X-Stats-Userid:
      - '0'
      X-Stats-Apiclientid:
      - '1413328'
      X-Stats-Apipermissionid:
      - '23658502'
      X-Xss-Protection:
      - 1; mode=block; report=/xss-report/01931b2c-e6a6-433c-935a-aab737a5d1e5?source%5Baction%5D=show&source%5Bcontroller%5D=admin%2Ftransactions&source%5Bsection%5D=admin
      X-Request-Id:
      - 01931b2c-e6a6-433c-935a-aab737a5d1e5
      P3p:
      - CP="NOI DSP COR NID ADMa OPTa OUR NOR"
      X-Dc:
      - ash
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Content-Type-Options:
      - nosniff
      - nosniff
    body:
      encoding: ASCII-8BIT
      string: '{"transaction":{"id":4191791427,"order_id":3836113411,"amount":"100.00","kind":"capture","gateway":"","status":"success","message":null,"created_at":"2016-09-29T10:56:24-04:00","test":false,"authorization":null,"currency":"CAD","location_id":null,"user_id":null,"parent_id":null,"device_id":null,"receipt":{},"error_code":null,"source_name":"1413328"}}'
    http_version: 
  recorded_at: Thu, 29 Sep 2016 14:56:25 GMT
- request:
    method: post
    uri: https://glossier-pop-staging.myshopify.com/admin/orders/3836113411/refunds.json
    body:
      encoding: UTF-8
      string: '{"refund":{"shipping":{"amount":0},"note":null,"notify":false,"restock":false,"transactions":[{"parent_id":4191791427,"amount":"1.0","gateway":"shopify-payments","kind":"refund"}]}}'
    headers:
      Authorization:
      - Basic MWI3ZjYzYmYyNDg4MzFjN2FlMmJlYWNmOWJjMzBiYmI6YjFjOTE1NTE1ZDA4ZTIwMzc5MzBhODQ0Zjc0MzY2MTA=
      Content-Type:
      - application/json
      User-Agent:
      - ShopifyAPI/4.3.2 ActiveResource/4.1.0 Ruby/2.3.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Server:
      - nginx
      Date:
      - Thu, 29 Sep 2016 14:56:26 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Frame-Options:
      - DENY
      X-Shopid:
      - '6779563'
      X-Shardid:
      - '2'
      X-Shopify-Shop-Api-Call-Limit:
      - 5/40
      Http-X-Shopify-Shop-Api-Call-Limit:
      - 5/40
      X-Stats-Userid:
      - '0'
      X-Stats-Apiclientid:
      - '1413328'
      X-Stats-Apipermissionid:
      - '23658502'
      Location:
      - https://glossier-pop-staging.myshopify.com/admin/orders/3836113411/refunds/145083715
      X-Xss-Protection:
      - 1; mode=block; report=/xss-report/021f3d06-a199-41c1-838c-e00d7ee41590?source%5Baction%5D=create&source%5Bcontroller%5D=admin%2Frefunds&source%5Bsection%5D=admin
      X-Request-Id:
      - 021f3d06-a199-41c1-838c-e00d7ee41590
      P3p:
      - CP="NOI DSP COR NID ADMa OPTa OUR NOR"
      X-Dc:
      - ash
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Content-Type-Options:
      - nosniff
      - nosniff
    body:
      encoding: UTF-8
      string: '{"refund":{"id":145083715,"order_id":3836113411,"created_at":"2016-09-29T10:56:25-04:00","note":null,"restock":false,"user_id":0,"refund_line_items":[],"transactions":[{"id":4191791619,"order_id":3836113411,"amount":"1.00","kind":"refund","gateway":"","status":"success","message":"Refunded
        1.00 from manual gateway","created_at":"2016-09-29T10:56:25-04:00","test":false,"authorization":null,"currency":"CAD","location_id":null,"user_id":null,"parent_id":4191791427,"device_id":null,"receipt":{},"error_code":null,"source_name":"1413328"}],"order_adjustments":[{"id":104827651,"order_id":3836113411,"refund_id":145083715,"amount":"-1.00","tax_amount":"0.00","kind":"refund_discrepancy","reason":"Refund
        discrepancy"}]}}'
    http_version: 
  recorded_at: Thu, 29 Sep 2016 14:56:26 GMT
- request:
    method: get
    uri: https://glossier-pop-staging.myshopify.com/admin/orders/3836113411.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Basic MWI3ZjYzYmYyNDg4MzFjN2FlMmJlYWNmOWJjMzBiYmI6YjFjOTE1NTE1ZDA4ZTIwMzc5MzBhODQ0Zjc0MzY2MTA=
      Accept:
      - application/json
      User-Agent:
      - ShopifyAPI/4.3.2 ActiveResource/4.1.0 Ruby/2.3.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 29 Sep 2016 14:56:26 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      X-Frame-Options:
      - DENY
      X-Shopid:
      - '6779563'
      X-Shardid:
      - '2'
      X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      Http-X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      X-Stats-Userid:
      - '0'
      X-Stats-Apiclientid:
      - '1413328'
      X-Stats-Apipermissionid:
      - '23658502'
      X-Xss-Protection:
      - 1; mode=block; report=/xss-report/6160b62e-e73e-4112-a790-9ee17b8de7ac?source%5Baction%5D=show&source%5Bcontroller%5D=admin%2Forders&source%5Bsection%5D=admin
      X-Request-Id:
      - 6160b62e-e73e-4112-a790-9ee17b8de7ac
      P3p:
      - CP="NOI DSP COR NID ADMa OPTa OUR NOR"
      X-Dc:
      - ash
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Content-Type-Options:
      - nosniff
      - nosniff
    body:
      encoding: ASCII-8BIT
      string: '{"order":{"id":3836113411,"email":"cab@godynamo.com","closed_at":null,"created_at":"2016-09-29T10:56:24-04:00","updated_at":"2016-09-29T10:56:25-04:00","number":408,"note":null,"token":"b523716f8577460710c16a61edc197ff","gateway":"","test":false,"total_price":"100.00","subtotal_price":"100.00","total_weight":0,"total_tax":"0.00","taxes_included":false,"currency":"CAD","financial_status":"partially_refunded","confirmed":true,"total_discounts":"0.00","total_line_items_price":"100.00","cart_token":null,"buyer_accepts_marketing":false,"name":"#1408","referring_site":null,"landing_site":null,"cancelled_at":null,"cancel_reason":null,"total_price_usd":"76.55","checkout_token":null,"reference":null,"user_id":null,"location_id":null,"source_identifier":null,"source_url":null,"processed_at":"2016-09-29T10:56:24-04:00","device_id":null,"browser_ip":null,"landing_site_ref":null,"order_number":1408,"discount_codes":[],"note_attributes":[],"payment_gateway_names":[""],"processing_method":"","checkout_id":null,"source_name":"1413328","fulfillment_status":"fulfilled","tax_lines":[],"tags":"","contact_email":"cab@godynamo.com","order_status_url":null,"line_items":[{"id":7084987971,"variant_id":null,"title":"title","quantity":1,"price":"100.00","grams":0,"sku":null,"variant_title":null,"vendor":null,"fulfillment_service":"manual","product_id":null,"requires_shipping":true,"taxable":true,"gift_card":false,"name":"title","variant_inventory_management":null,"properties":[],"product_exists":false,"fulfillable_quantity":0,"total_discount":"0.00","fulfillment_status":"fulfilled","tax_lines":[]}],"shipping_lines":[],"billing_address":{"first_name":"John","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","zip":"K2P 1L4","province":"Ontario","country":"Canada","last_name":"Smith","address2":null,"company":null,"latitude":45.4203521,"longitude":-75.69314750000001,"name":"John
        Smith","country_code":"CA","province_code":"ON"},"shipping_address":{"first_name":"John","address1":"123
        Fake Street","phone":"555-555-5555","city":"Fakecity","zip":"K2P 1L4","province":"Ontario","country":"Canada","last_name":"Smith","address2":null,"company":null,"latitude":45.4203521,"longitude":-75.69314750000001,"name":"John
        Smith","country_code":"CA","province_code":"ON"},"fulfillments":[{"id":3140974915,"order_id":3836113411,"status":"success","created_at":"2016-09-29T10:56:24-04:00","service":"manual","updated_at":"2016-09-29T10:56:24-04:00","tracking_company":null,"shipment_status":null,"tracking_number":null,"tracking_numbers":[],"tracking_url":null,"tracking_urls":[],"receipt":{},"line_items":[{"id":7084987971,"variant_id":null,"title":"title","quantity":1,"price":"100.00","grams":0,"sku":null,"variant_title":null,"vendor":null,"fulfillment_service":"manual","product_id":null,"requires_shipping":true,"taxable":true,"gift_card":false,"name":"title","variant_inventory_management":null,"properties":[],"product_exists":false,"fulfillable_quantity":0,"total_discount":"0.00","fulfillment_status":"fulfilled","tax_lines":[]}]}],"refunds":[{"id":145083715,"order_id":3836113411,"created_at":"2016-09-29T10:56:25-04:00","note":null,"restock":false,"user_id":0,"refund_line_items":[],"transactions":[{"id":4191791619,"order_id":3836113411,"amount":"1.00","kind":"refund","gateway":"","status":"success","message":"Refunded
        1.00 from manual gateway","created_at":"2016-09-29T10:56:25-04:00","test":false,"authorization":null,"currency":"CAD","location_id":null,"user_id":null,"parent_id":4191791427,"device_id":null,"receipt":{},"error_code":null,"source_name":"1413328"}],"order_adjustments":[{"id":104827651,"order_id":3836113411,"refund_id":145083715,"amount":"-1.00","tax_amount":"0.00","kind":"refund_discrepancy","reason":"Refund
        discrepancy"}]}],"customer":{"id":3934271555,"email":"paul.norman@example.com","accepts_marketing":false,"created_at":"2016-08-10T15:41:49-04:00","updated_at":"2016-09-29T10:56:26-04:00","first_name":"Paul","last_name":"Norman","orders_count":4,"state":"disabled","total_spent":"399.00","last_order_id":3836113411,"note":null,"verified_email":true,"multipass_identifier":null,"tax_exempt":false,"tags":"","last_order_name":"#1408","default_address":{"id":4150214851,"first_name":"John","last_name":"Smith","company":null,"address1":"123
        Fake Street","address2":null,"city":"Fakecity","province":"Ontario","country":"Canada","zip":"K2P
        1L4","phone":"555-555-5555","name":"John Smith","province_code":"ON","country_code":"CA","country_name":"Canada","default":true}}}}'
    http_version: 
  recorded_at: Thu, 29 Sep 2016 14:56:26 GMT
- request:
    method: delete
    uri: https://glossier-pop-staging.myshopify.com/admin/orders/3836113411.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Basic MWI3ZjYzYmYyNDg4MzFjN2FlMmJlYWNmOWJjMzBiYmI6YjFjOTE1NTE1ZDA4ZTIwMzc5MzBhODQ0Zjc0MzY2MTA=
      Accept:
      - application/json
      User-Agent:
      - ShopifyAPI/4.3.2 ActiveResource/4.1.0 Ruby/2.3.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 29 Sep 2016 14:56:27 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      X-Frame-Options:
      - DENY
      X-Shopid:
      - '6779563'
      X-Shardid:
      - '2'
      X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      Http-X-Shopify-Shop-Api-Call-Limit:
      - 4/40
      X-Stats-Userid:
      - '0'
      X-Stats-Apiclientid:
      - '1413328'
      X-Stats-Apipermissionid:
      - '23658502'
      Location:
      - "/admin/orders"
      X-Xss-Protection:
      - 1; mode=block; report=/xss-report/69ee6d04-0d87-4387-ad24-42a5b3df0912?source%5Baction%5D=destroy&source%5Bcontroller%5D=admin%2Forders&source%5Bsection%5D=admin
      X-Request-Id:
      - 69ee6d04-0d87-4387-ad24-42a5b3df0912
      P3p:
      - CP="NOI DSP COR NID ADMa OPTa OUR NOR"
      X-Dc:
      - ash
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Content-Type-Options:
      - nosniff
      - nosniff
    body:
      encoding: ASCII-8BIT
      string: "{}"
    http_version: 
  recorded_at: Thu, 29 Sep 2016 14:56:27 GMT
recorded_with: VCR 3.0.3
